---
title: BRepBuilderPersistentIds
classe: Autodesk.Revit.DB.BRepBuilderPersistentIds
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# BRepBuilderPersistentIds

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `bRepBuilderPersistentIds.IsValidObject` | Boolean |
| `Void AddSubTag(ExternalGeometryId, BRepBuilderGeometryId)` | `bRepBuilderPersistentIds.AddSubTag(externalGeometryId, brepBuilderGeometryId)` | Void |
| `Void Dispose()` | `bRepBuilderPersistentIds.Dispose()` | Void |
| `Boolean IsAssociatedBRepBuilderValid()` | `bRepBuilderPersistentIds.IsAssociatedBRepBuilderValid()` | Boolean |
| `Boolean IsBRepBuilderGeometryIdFaceOrEdge(BRepBuilderGeometryId)` | `bRepBuilderPersistentIds.IsBRepBuilderGeometryIdFaceOrEdge(brepBuilderGeometryId)` | Boolean |
| `Boolean IsValidBRepBuilderGeometryIdForNewCorrespondence(BRepBuilderGeometryId)` | `bRepBuilderPersistentIds.IsValidBRepBuilderGeometryIdForNewCorrespondence(brepBuilderGeometryId)` | Boolean |
| `Boolean IsValidExternalGeometryIdForNewCorrespondence(ExternalGeometryId)` | `bRepBuilderPersistentIds.IsValidExternalGeometryIdForNewCorrespondence(externalGeometryId)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```